src/Documents/РеализацияБилетов/РеализацияБилетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
	<name>РеализацияБилетов</name>
	<registerRecords>AccumulationRegister.ВзаиморасчетыСКассирами</registerRecords>
	<registerRecords>AccumulationRegister.ВзаиморасчетыСАгенствами</registerRecords>
	<registerRecords>AccumulationRegister.ПродажиБилетов</registerRecords>
	<attributes>
		<name>Кассир</name>
		<type>
			<types>CatalogRef.Кассир</types>
		</type>
	</attributes>
	<tabularSections>
		<name>Билеты</name>
		<attributes>
			<name>Билет</name>
			<type>
				<types>CatalogRef.Билет</types>
			</type>
		</attributes>
		<attributes>
			<name>Выписан</name>
			<type>
				<types>Date</types>
				<dateQualifiers>
					<dateFractions>Date</dateFractions>
				</dateQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>PNR</name>
			<type>
				<types>String</types>
				<stringQualifiers>
					<length>10</length>
				</stringQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>ДатаВылета</name>
			<type>
				<types>Date</types>
				<dateQualifiers>
					<dateFractions>Date</dateFractions>
				</dateQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>Направление</name>
			<type>
				<types>CatalogRef.Направления</types>
			</type>
		</attributes>
		<attributes>
			<name>СтатусБилета</name>
			<type>
				<types>EnumRef.СтатусБилета</types>
			</type>
		</attributes>
		<attributes>
			<name>СуммаТарифаEUR</name>
			<type>
				<types>Number</types>
				<numberQualifiers>
					<precision>15</precision>
					<scale>3</scale>
				</numberQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>СуммаТарифа</name>
			<type>
				<types>Number</types>
				<numberQualifiers>
					<precision>15</precision>
					<scale>3</scale>
				</numberQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>Сборы</name>
			<type>
				<types>Number</types>
				<numberQualifiers>
					<precision>15</precision>
					<scale>3</scale>
				</numberQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>ИтогоСумма</name>
			<type>
				<types>Number</types>
				<numberQualifiers>
					<precision>15</precision>
					<scale>3</scale>
				</numberQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>ВалютаВзаиморасчетов</name>
			<type>
				<types>CatalogRef.Валюта</types>
			</type>
		</attributes>
		<attributes>
			<name>Валидатор</name>
			<type>
				<types>CatalogRef.Пульт</types>
			</type>
		</attributes>
		<attributes>
			<name>Покупатель</name>
			<type>
				<types>String</types>
				<stringQualifiers>
					<length>50</length>
				</stringQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>АВК</name>
			<type>
				<types>CatalogRef.Авиакомпания</types>
			</type>
		</attributes>
		<attributes>
			<name>МаскаБилета</name>
			<type>
				<types>String</types>
				<stringQualifiers>
					<length>10</length>
				</stringQualifiers>
			</type>
		</attributes>
		<attributes>
			<name>ВалютаБилета</name>
			<type>
				<types>CatalogRef.Валюта</types>
			</type>
		</attributes>
		<attributes>
			<name>Курс</name>
			<type>
				<types>Number</types>
				<numberQualifiers>
					<precision>15</precision>
					<scale>3</scale>
				</numberQualifiers>
			</type>
		</attributes>
	</tabularSections>
</mdclass:Document>

src/AccumulationRegisters/ПродажиБилетов/ПродажиБилетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
	<name>ПродажиБилетов</name>
	<registerType>Turnovers</registerType>
	<resources>
		<name>Итого</name>
		<type>
			<types>Number</types>
			<numberQualifiers>
				<precision>15</precision>
				<scale>2</scale>
			</numberQualifiers>
		</type>
	</resources>
	<resources>
		<name>АГС</name>
		<type>
			<types>Number</types>
			<numberQualifiers>
				<precision>15</precision>
				<scale>2</scale>
			</numberQualifiers>
		</type>
	</resources>
	<resources>
		<name>Тариф</name>
		<type>
			<types>Number</types>
			<numberQualifiers>
				<precision>10</precision>
			</numberQualifiers>
		</type>
	</resources>
	<resources>
		<name>СУБ</name>
		<type>
			<types>Number</types>
			<numberQualifiers>
				<precision>15</precision>
				<scale>2</scale>
			</numberQualifiers>
		</type>
	</resources>
	<resources>
		<name>АГН</name>
		<type>
			<types>Number</types>
			<numberQualifiers>
				<precision>15</precision>
				<scale>2</scale>
			</numberQualifiers>
		</type>
	</resources>
	<resources>
		<name>СуммаОтАВК</name>
		<type>
			<types>Number</types>
			<numberQualifiers>
				<precision>15</precision>
				<scale>2</scale>
			</numberQualifiers>
		</type>
	</resources>
	<resources>
		<name>СуммаСУБ</name>
		<type>
			<types>Number</types>
			<numberQualifiers>
				<precision>15</precision>
				<scale>2</scale>
			</numberQualifiers>
		</type>
	</resources>
	<resources>
		<name>Прибыль</name>
		<type>
			<types>Number</types>
			<numberQualifiers>
				<precision>15</precision>
				<scale>2</scale>
			</numberQualifiers>
		</type>
	</resources>
	<resources>
		<name>ТарифВВалюте</name>
		<type>
			<types>Number</types>
			<numberQualifiers>
				<precision>15</precision>
				<scale>2</scale>
			</numberQualifiers>
		</type>
	</resources>
	<resources>
		<name>ИтогоВВалюте</name>
		<type>
			<types>Number</types>
			<numberQualifiers>
				<precision>15</precision>
				<scale>2</scale>
			</numberQualifiers>
		</type>
	</resources>
	<resources>
		<name>АГСВВалюте</name>
		<type>
			<types>Number</types>
			<numberQualifiers>
				<precision>15</precision>
				<scale>2</scale>
			</numberQualifiers>
		</type>
	</resources>
	<resources>
		<name>СуммаНДС</name>
		<type>
			<types>Number</types>
			<numberQualifiers>
				<precision>15</precision>
				<scale>2</scale>
			</numberQualifiers>
		</type>
	</resources>
	<attributes>
		<name>ВидОперации</name>
		<type>
			<types>EnumRef.ХозОперации</types>
		</type>
	</attributes>
	<dimensions>
		<name>Субагент</name>
		<type>
			<types>CatalogRef.Кассир</types>
		</type>
	</dimensions>
	<dimensions>
		<name>Направление</name>
		<type>
			<types>CatalogRef.Направления</types>
		</type>
	</dimensions>
	<dimensions>
		<name>НомерБилета</name>
		<type>
			<types>Number</types>
			<numberQualifiers>
				<precision>10</precision>
			</numberQualifiers>
		</type>
	</dimensions>
	<dimensions>
		<name>PNR</name>
		<type>
			<types>String</types>
			<stringQualifiers>
				<length>10</length>
			</stringQualifiers>
		</type>
	</dimensions>
	<dimensions>
		<name>АВК</name>
		<type>
			<types>CatalogRef.Агенство</types>
		</type>
	</dimensions>
	<dimensions>
		<name>ДатаПродажи</name>
		<type>
			<types>Date</types>
			<dateQualifiers>
				<dateFractions>Date</dateFractions>
			</dateQualifiers>
		</type>
	</dimensions>
	<dimensions>
		<name>ДатаВылета</name>
		<type>
			<types>Date</types>
			<dateQualifiers>
				<dateFractions>Date</dateFractions>
			</dateQualifiers>
		</type>
	</dimensions>
	<dimensions>
		<name>Билет</name>
		<type>
			<types>CatalogRef.Билет</types>
		</type>
	</dimensions>
	<dimensions>
		<name>ВалютаВзаиморасчетов</name>
		<type>
			<types>CatalogRef.Валюта</types>
		</type>
	</dimensions>
	<dimensions>
		<name>Пульт</name>
		<type>
			<types>CatalogRef.Пульт</types>
		</type>
	</dimensions>
	<dimensions>
		<name>ВалютаБилета</name>
		<type>
			<types>CatalogRef.Валюта</types>
		</type>
	</dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/ВзаиморасчетыСАгенствами/ВзаиморасчетыСАгенствами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
	<name>ВзаиморасчетыСАгенствами</name>
	<resources>
		<name>СуммаЗадолженностиАГН</name>
		<type>
			<types>Number</types>
			<numberQualifiers>
				<precision>10</precision>
			</numberQualifiers>
		</type>
	</resources>
	<attributes>
		<name>ВидОперации</name>
		<type>
			<types>EnumRef.ХозОперации</types>
		</type>
	</attributes>
	<dimensions>
		<name>Авиакомпания</name>
		<type>
			<types>CatalogRef.Агенство</types>
		</type>
	</dimensions>
	<dimensions>
		<name>Билет</name>
		<type>
			<types>CatalogRef.Билет</types>
		</type>
	</dimensions>
	<dimensions>
		<name>ВалютаВзаиморасчетов</name>
		<type>
			<types>CatalogRef.Валюта</types>
		</type>
	</dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/ВзаиморасчетыСКассирами/ВзаиморасчетыСКассирами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
	<name>ВзаиморасчетыСКассирами</name>
	<resources>
		<name>СуммаЗадолженности</name>
		<type>
			<types>Number</types>
			<numberQualifiers>
				<precision>15</precision>
				<scale>2</scale>
			</numberQualifiers>
		</type>
	</resources>
	<dimensions>
		<name>Билет</name>
		<type>
			<types>CatalogRef.Билет</types>
		</type>
	</dimensions>
	<dimensions>
		<name>ВалютаВзаиморасчетов</name>
		<type>
			<types>CatalogRef.Валюта</types>
		</type>
	</dimensions>
	<dimensions>
		<name>Субагент</name>
		<type>
			<types>CatalogRef.Кассир</types>
		</type>
	</dimensions>
	<dimensions>
		<name>Организация</name>
		<type>
			<types>CatalogRef.Организация</types>
		</type>
	</dimensions>
</mdclass:AccumulationRegister>

src/Enums/ХозОперации/ХозОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
	<name>ХозОперации</name>
	<enumValues>
		<name>ОплатаПоставщику</name>
	</enumValues>
	<enumValues>
		<name>ПрочийРасход</name>
	</enumValues>
	<enumValues>
		<name>ПоступлениеОтКлиента</name>
	</enumValues>
	<enumValues>
		<name>ВозвратПокупателю</name>
	</enumValues>
	<enumValues>
		<name>Штраф</name>
	</enumValues>
	<enumValues>
		<name>ПродажаБилета</name>
	</enumValues>
	<enumValues>
		<name>Конвертация</name>
	</enumValues>
</mdclass:Enum>

src/Documents/РеализацияБилетов/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	#Область РегПродажи
	Движения.ПродажиБилетов.Записывать = Истина;
	СуммаСуб=0;
	СуммаАГН=0;
	МассивБилетов=Новый Массив;
	Для Каждого ТекСтрокаБилеты Из Билеты Цикл
		Движение = Движения.ПродажиБилетов.Добавить();
		Движение.Период = Дата;
		Движение.Субагент = Кассир;
		Движение.НомерБилета = Номер;
		Движение.PNR = ТекСтрокаБилеты.PNR;
		Движение.ДатаПродажи = ТекСтрокаБилеты.Выписан;
		Движение.ДатаВылета = ТекСтрокаБилеты.ДатаВылета;
		Движение.Направление=ТекСтрокаБилеты.Направление;
		Движение.Итого = ТекСтрокаБилеты.ИтогоСумма;
		Движение.Тариф = ТекСтрокаБилеты.СуммаТарифа;
		Агенство=МодульПроведенияНаСервере.НайтиПульт(ТекСтрокаБилеты.Валидатор);
		Движение.АВК = Агенство;
		КлючьАналитики=Строка(ТекСтрокаБилеты.АВК)+Строка(ТекСтрокаБилеты.Направление)+Строка(Агенство);
		СуммаОтАВК=МодульПроведенияНаСервере.ВозвратПроцентовАГН(КлючьАналитики,ТекСтрокаБилеты.Выписан);		
		СуммаОтСУБ=МодульПроведенияНаСервере.ВозвратПроцентовСУБ(КлючьАналитики,Кассир,КонецДня(ТекСтрокаБилеты.Выписан));
		Движение.СуммаОтАВК=СуммаОтАВК*ТекСтрокаБилеты.СуммаТарифа;
		Движение.СуммаСУБ=СуммаОтСУБ*ТекСтрокаБилеты.СуммаТарифа;
		Движение.ТарифВВалюте=ТекСтрокаБилеты.СуммаТарифа*ТекСтрокаБилеты.Курс;
		Движение.ИтогоВВалюте=ТекСтрокаБилеты.ИтогоСумма*ТекСтрокаБилеты.Курс;
		Движение.АГСВВалюте=ТекСтрокаБилеты.Сборы*ТекСтрокаБилеты.Курс;
		СуммаАГН=Движение.СуммаОтАВК;
		СуммаСуб=Движение.СуммаСУБ;
		Движение.Прибыль=СуммаАГН-СуммаСуб;
		Движение.АГН=СуммаОтАВК;
		Движение.СуммаНДС=МодульПроведенияНаСервере.ВозвратНДС(ТекСтрокаБилеты.Валидатор,СуммаОтАВК);
		Движение.СУБ=СуммаОтСУБ;
		Движение.Билет=ТекСтрокаБилеты.Билет;
		Движение.ВалютаБилета=ТекСтрокаБилеты.ВалютаБилета;
		Движение.АГС=ТекСтрокаБилеты.Сборы;
		Движение.ВидОперации=Перечисления.ХозОперации.ПродажаБилета;
		Движение.ВалютаВзаиморасчетов=ТекСтрокаБилеты.ВалютаВзаиморасчетов;
		МассивБилетов.Добавить(ТекСтрокаБилеты.Билет);
	КонецЦикла;
	#КонецОбласти
	#Область РегВзаиморасчесты
	Движения.ВзаиморасчетыСАгенствами.Записывать=Истина;
	Для каждого ТекСтрокаБилеты Из Билеты Цикл
		ДвижениеРасчеты = Движения.ВзаиморасчетыСАгенствами.Добавить();
		ДвижениеРасчеты.ВидДвижения=ВидДвиженияНакопления.Приход;
		ДвижениеРасчеты.СуммаЗадолженностиАГН=ТекСтрокаБилеты.ИтогоСумма-СуммаАГН;
		ДвижениеРасчеты.Период = Дата;
		ДвижениеРасчеты.Авиакомпания=МодульПроведенияНаСервере.НайтиПульт(ТекСтрокаБилеты.Валидатор);
		ДвижениеРасчеты.Билет=ТекСтрокаБилеты.Билет;
		ДвижениеРасчеты.ВалютаВзаиморасчетов=ТекСтрокаБилеты.ВалютаВзаиморасчетов;
		ДвижениеРасчеты.ВидОперации=Перечисления.ХозОперации.ПродажаБилета;
	КонецЦикла;
	#КонецОбласти
	#Область РегВзаиморасчетыСКассирами
	Движения.ВзаиморасчетыСКассирами.Записывать=Истина;
	Для каждого ТекСтрокаБилеты ИЗ Билеты Цикл
	ДвижениеРасчеты=Движения.ВзаиморасчетыСКассирами.Добавить();
	ДвижениеРасчеты.ВидДвижения=ВидДвиженияНакопления.Приход;
	Агенство=МодульПроведенияНаСервере.НайтиПульт(ТекСтрокаБилеты.Валидатор);
	РезультатПоВалюте=МодульПроведенияНаСервере.ВедутсяВзаиморасчетыВВалюте(ТекСтрокаБилеты.Валидатор,Агенство);
	СуммаИтого=ТекСтрокаБилеты.ИтогоСумма;
	Если РезультатПоВалюте И ТекСтрокаБилеты.ВалютаБилета<>Справочники.Валюта.НайтиПоНаименованию("TJS")  Тогда
	СуммаИтого=СуммаИтого*ТекСтрокаБилеты.Курс;
	СуммаСуб=СуммаСуб*ТекСтрокаБилеты.Курс;	
	ДвижениеРасчеты.ВалютаВзаиморасчетов=ТекСтрокаБилеты.ВалютаБилета;
	ДвижениеРасчеты.СуммаЗадолженности=СуммаИтого-СуммаСуб;
	Иначе
	ДвижениеРасчеты.ВалютаВзаиморасчетов=ТекСтрокаБилеты.ВалютаВзаиморасчетов;
	ДвижениеРасчеты.СуммаЗадолженности=СуммаИтого-СуммаСуб;
	КонецЕсли;
	ДвижениеРасчеты.Билет=ТекСтрокаБилеты.Билет;
	ДвижениеРасчеты.Организация=Справочники.Организация.ОсновнаяОрганизация;
	ДвижениеРасчеты.Период=Дата;
	ДвижениеРасчеты.Субагент=Кассир;	
	КонецЦикла;
	#КонецОбласти
	//Отправка обработнных документов для обработки в регистре ЖурналыДокументов
	МодульПроведенияНаСервере.ОбработкаРегистраЖурнал(МассивБилетов,"Проведение");
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)	
	МодульПроведенияНаСервере.ОбработкаРегистраЖурнал(Билеты.ВыгрузитьКолонку("Билет"),"ОтменаПроведения");
КонецПроцедуры


Процедура ПередУдалением(Отказ)
	МодульПроведенияНаСервере.ОбработкаРегистраЖурнал(Билеты.ВыгрузитьКолонку("Билет"),"ОтменаПроведения");
КонецПроцедуры
